const text = `《历史转折中的邓小平》

龙平平 黄亚洲 张强 魏人
18个笔记

第一章 “邓小平，你在哪里？”

◆ 2024/11/25发表想法

历史书上只是简简单单的几句话，却包含了太多的事情，情绪和许许多多不同人的不同人生啊


第二章 不是一个人的复出，可能是一个国家的复出

◆ 2024/11/26发表想法

和第一章的我还可以再为国家奋斗20年时呼应的，主要中央需要我，我随时都做好了准备

原文：于是邓小平想了想，神态平静地对叶帅说，叶帅，这些日子，不瞒你说，我也一直在想这个问题呀。想来想去，还是那句话，听中央的安排吧。

◆ 2024/11/26发表想法

实事求是

原文：这封信上有这样一段寓意深刻的话：“我们必须世世代代地用准确的完整的毛泽东思想来指导我们全党、全军和全国人民，把党和社会主义的事业，把国际共产主义运动的事业，胜利地推向前进。

◆ 2024/11/26发表想法

站在这个历史路口的决策位置，不是有大谋略大智慧大胆识之人，是无法做出正确的选择的。天佑中华，在教员后又能有邓公这种伟人来帮助中国在历史的分岔口再一次做出艰难却是正确的选择。

原文：那些日子，在华国锋所居住的中南海宅所里，那盏办公室里的台灯都是亮到深夜才熄灭的。

◆ 2024/11/26发表想法

对邓公的认可与期冀

原文：叶剑英听后，再次摇摇头说，如今百废待兴，需要大智慧、大手笔、大图纸啊。


第三章 向科学致敬，向教育致敬

◆ 2024/11/26发表想法

伟人的魄力，在经历了三起三落后，仍然敢站出来坚持真理，实事求是，敢于扛起相关责任，只有这种大气魄的人才能将国家领向正轨

原文：既然所有人都认为这个案应该翻，翻这个案，对国家有利，对人民有利，对实行四个现代化有利，既然如此，我们就应该义无反顾地去翻这个案。认准了是对的事情，就应该坚决去做。这件事如果有什么风险的话，一切由我来承担。


第六章 高考！高考！

◆ 2024/11/27发表想法

命运共同体

原文：自己个人的命运完全是跟国家的命运捆在一起的。自己个人出路的前提，是国家必须有正确的前进方向，不然两者是拧不到一起的。


第八章 山雨欲来风满楼

◆ 2024/11/28发表想法

提出分析解决，三大步骤

原文：毛泽东同志历来坚持要用马列主义的立场、观点、方法来提出问题，分析问题，解决问题。

◆ 2024/11/28发表想法

高手过招，每一步就是深思熟虑，有目的性的。遇到不好表态或者不明确对方态度的事情时，最好的办法就是把问题抛回去，听听对方观点

原文：张平化赶紧说，小平同志您就吩咐吧，有什么事我们能做的，就一定好好做。
邓小平开门见山地说，平化同志，对真理标准的讨论，你们是怎么看的？
张平化心里一紧，果然是单刀直入，于是不急不慌地说，我想听听小平同志的指示。
张平化想，接的球，还是踢回去好，这样才不至于被动。
邓小平仿佛看明白了对方的心思，干脆就把话挑明了：实践是检验真理的唯一标准，这个判断，是符合马克思主义的。《光明日报》那篇文章是对的，是驳不倒的，我是同意这篇文章的观点的。但是有人反对，说是反毛主席，帽子可大啦，这样不好嘛！


第九章 在东北“点了一把火”

◆ 2024/11/28发表想法

制度的优越性，不以利益驱动，不以获取利益为目标，集中力量办大事。这就叫中国速度

原文：社会主义的优越性就体现在发展速度比资本主义更快些。


第十章 现在，应该注视大洋彼岸

◆ 2024/11/29发表想法

这就是领导的大气魄，可以更清晰地看清楚问题本质，不因小失大，不会因为一部分爱国信念不坚定之人的背叛，而放弃让更多爱国信念坚定的人深造的机会，从而进一步限制了国家科技技术的发展。

原文：邓小平马上说，这个不用怕！留学生绝大多数是好的，个别人出点问题也没有什么了不起的，即使一千人跑掉一百个，也只占十分之一。


第十三章 闭幕讲话其实是启幕讲话，是进军号

◆ 2024/11/29发表想法

从看客的角度，会觉得华主席和汪副主席一直在错误的道路上行进，和其他领导人的想法是相悖的。自然而然的就会觉得，他们之间是有隔阂，有间隙的。可是从这里的对话就能看出，这些领导人们也一直秉承着实事求是的精神，在集体中每个人都是有自己的主张的，主张错误不代表人本身有问题。如果因为主张不同就产生隔阂，进而互相对立，那与文革时期有什么区别。真是因为大家的方向是一致的，是为了国家的发展更向前一步，所以才会更团结，分歧那就解决问题，要团结一致向前看。这在我看来才是真正的民主。而不是所谓的多党轮流执政，竞选活动时互相泼脏水，互相揭露错误观点，甚至于在上任后对政敌进行污蔑，恶意栽赃审判，与黑社会也没什么区别。这样看，也只是披着“民主”的“皇帝的新衣”罢了

原文：就在三人爽朗大笑的时候，华国锋与汪东兴走了进来。华国锋一见邓小平就眼睛一亮，紧着走上几步与他握手，说，小平同志辛苦啦，刚出访回来就忙于中美建交谈判问题，真是马不停蹄呀。
叶剑英说，小平同志回来就好办了。这一阵子国锋同志已经是焦头烂额了。东兴同志的日子也不好过呀。
汪东兴听叶帅这么说，也就摇了摇头。华国锋说，是啊，中央工作会议已经开了十几天了。各组的问题越谈越多，都等着中央拿主意。
叶剑英说，现在是两个会场。京西宾馆一个会场；西单还有一个会场，那里大字报很多，群众也发动起来了。
华国锋一听这话就说，局面很复杂啊。小平同志，您有经验也有权威，这个时候还请您多拿大主意呀。


第十五章 “让孩子们回来吧！”

◆ 2024/12/02发表想法

很多时候，难的不是遇到问题，而是遇到问题时的决断力，有没有那个魄力和勇气去做出那个决定，并面对后续遇到的一系列问题。夫妻相处，父子相处也是这样。该你拿主意，下定论时，你不能畏缩不前，不能避而不谈的。就像孩子看电视的问题，父辈关于子女喂养和教育的问题，都是一样的。你要拿出魄力来下决断的，这才是真正的勇气


第十七章 香港棋局，深圳棋局

◆ 2024/12/02发表想法

前苏联在一战后迅速发展了起来，用二三十年就走完了资本主义将近百年的发展道路，并且给人民的生活质量带来了显著的提升，这就是社会主义的优越性。也正是因为这样子，才会在世界内带来那么大范围的红色思潮。如果中国不走改革开放这条路，没有这几十年的经济腾飞，又怎么能体现出社会主义的优越性呢。随着现在国家的国力和经济越来越好，对于优越性的感受，会越来越深的。

原文：社会主义不体现优越性，那还叫什么社会主义呢？


第十八章 开弓没有回头箭

◆ 2024/12/02发表想法

我小时候第一次回家看到麦苗也是这样子的😂

原文：她老是指着田里的麦苗问这是不是韭菜，直把田源笑得喷了出来。


第二十章 思索香港的百年回归，思索干部的新老交替

◆ 2024/12/03发表想法

不知道修宪后，会不会带来相同的问题。

原文：，我赞同陈云同志的这个意见。干部“终身制”是个大问题，一个人老当第一书记，哪个敢提意见？


第二十二章 “我深情地爱着我的祖国和人民”

◆ 2024/12/03发表想法

在1976年到1984年这一段拨乱反正，改革开放的时期里，实事求是就是核心思想

原文：邓小平赶紧摆手说，叶帅可不要这样讲。我们几个，都是毛主席的学生。我读的书不多，就是一条，相信主席讲的实事求是。过去主席带领我们干革命，靠的是实事求是；今天我们搞建设，同样也要靠实事求是。我们的责任是到二十世纪末的时候，把我国建成一个小康社会。我们虽然活不到那个时候，但是有责任提出那个时候的目标。

◆ 2024/12/03发表想法

用这段话开篇并结尾，是对小平同志一生最好的总结与肯定

原文：我是中国人民的儿子，我深情地爱着我的祖国和人民。我深深地相信，中国的未来是属于中国人民的，世界的未来是属于世界人民的。

-- 来自微信读书`;
function getNoteItems(text) {
  // +3 是为了跳过“3个笔记”, + 2 是为了跳过“\n”
    // const text = $text;
    const bookName = text.split('\n')[0];
    const notesStartIndex = text.indexOf('个笔记') + 3 + 2;
    const notesEndIndex = text.indexOf('-- 来自微信读书');
    const notesText = text.substring(notesStartIndex, notesEndIndex);

    const chapterItems = notesText.split('\n\n\n');
    var notesResult = [];
    var tempNote = '';
    chapterItems.forEach((item, index) => {
      // item = item.replace(/\n/g, '');
      // item = item.replace(/^\s*[\r\n]/gm, '');
      const noteItems = item.split('\n\n');
      // 首个不是以“◆”开头的，就是章节标题
      const hasChapter = !noteItems[0].startsWith('◆');
      const chapter = noteItems[0];
      noteItems.forEach((noteItem, noteIdx) => {
        if (hasChapter, noteIdx === 0) {
          return;
        }
        if (noteItem.startsWith('◆')) {
          notesResult.push(tempNote);
          tempNote = bookName + "\n" + chapter + "\n" + noteItem;
        } else {
          tempNote += "\n" + noteItem;
        }
      });
    });
    notesResult.push(tempNote);
    const result = notesResult.filter(item => item !== '');
    return JSON.stringify({"result": result});
}

const res = getNoteItems(text);
console.log(res);